app/controllers/todo_items_controller.rb

SELECT * FROM "tags" WHERE ("tags"."name" = 'Ruby') LIMIT 1
SELECT * FROM "todo_items" ORDER BY created_at desc
---
	def index
		if params[:tags] && @tag = Tag.find_by_name( params[ :tags ] )
			@todoItems = @tag.todo_items
		else
			@todoItems = TodoItem.all( :order => "created_at desc" )

INSERT INTO "todo_items" ("created_at", "title", "updated_at", "done") VALUES('2010-04-15 09:29:18', NULL, '2010-04-15 09:29:18', NULL)
SELECT * FROM "todo_items" ORDER BY created_at desc
---
	def create
		@todoItem = TodoItem.new( params[ :todo_item ] )
		if params[ :tag ]
			@tag = Tag.find( params[ :tag ] )
			@todoItem.tags << @tag
		end

		if @todoItem.save!
			redirect_to root_path
		else
			@todoItems = TodoItem.all( :order => "created_at desc" )

DELETE FROM "todo_items" WHERE ("id" IN ('1'))
---
	def destroy
		TodoItem.destroy params[ :id ]